<template>
    <div class="v-main-wrapper">
        <keep-alive>
            <router-view> </router-view>
        </keep-alive>
    </div>
</template>

<script>
export default {
    //Имя компонента - обязательный параметр
    name: "v-main-wrapper",
    //Дети этого компонента
    components: {},
    //то что прилетает из родителя
    props: {},
    //возращаемые данные этого компонента - персональные данные
    data() {
        return {}
    },
    //вычислительные св-ва компонента
    computed: {},
    //здесь отлавдиваются действия пользователя
    //различные клики, показы модальных окон, скрытие показ элементов, анимации и т.д.
    methods: {},
    //здесь мы следим, отлавливаем изменения, что происходит в компоненте
    watch: {},
//--- хуки жизненого цикла ---
    //отрабатывает когда компонент полностью загрузится - один из основных
    mounted() {},
    //обрабатывает перед удалением/закрытием компонента
    beforeDestroy() {}
}
</script>

<style>
 .v-main-wrapper {
     max-width: 900px;
     margin: 0 auto;
 }
</style>
